import { Data } from "../types/types";

const mockData: Data[] = [
    {
        startYear: 1980,
        endYear: 1986,
        title: 'Технологии',
        events: [
            {
                year: 1980,
                description: 'Sinclair Research выпускает домашний компьютер ZX80'
            },
            {
                year: 1982,
                description: 'Появляется компьютер ZX Spectrum, выпущенные компанией Sinclair Research'
            },
            {
                year: 1983,
                description: 'ARPANET официально переходит на использование протокола TCP/IP'
            },
            {
                year: 1984,
                description: 'Apple представляет компьютер Macintosh с революционным графическим интерфейсом и управлением мышью'
            },
            {
                year: 1985,
                description: 'Корпорация Microsoft выпускает первую версию операционной системы Windows 1.0'
            },
            {
                year: 1986,
                description: 'Компания Intel представляет первый 32-битный процессор для персональных компьютеров — Intel 80386 (i386)'
            }
        ]
    },
    {
        startYear: 1987,
        endYear: 1991,
        title: 'Кино',
        events: [
            {
                year: 1987,
                description: '"Хищник"/Predator, США (реж. Джон Мактирнан)'
            },
            {
                year: 1988,
                description: '"Кто подставил кролика Роджера"/Who framed Roger Rabbit, США (реж. Роберт Земекис)'
            },
            {
                year: 1989,
                description: '"Назад в будущее 2"/Back to the future 2, США (реж. Роберт Земекис)'
            },
            {
                year: 1991,
                description: '"Семейка Аддамс"/The Addams Family, США (реж. Барри Зонненфельд)'
            }
        ]
    },
    {
        startYear: 1992,
        endYear: 1997,
        title: 'Литература',
        events: [
            {
                year: 1992,
                description: 'Нобелевская премия по литературе - Дерек Уолкотт, "За блестящий образец карибского эпоса в 64 разделах'
            },
            {
                year: 1994,
                description: '"Бессоница" - роман Стивена Кинга'
            },
            {
                year: 1995,
                description: 'Нобелевская примерия по литературе - Шеймас Хини'
            },
            {
                year: 1997,
                description: '"Гарри Поттер и философский камень" - первая книга Джоан Роулинг'
            }
        ]
    },
    {
        startYear: 1999,
        endYear: 2004,
        title: 'Театр',
        events: [
            {
                year: 1999,
                description: 'Премьера балета "Золушка" в постановке Жан-Кристоф Майо, сценография Эрнеста Пиньона'
            },
            {
                year: 2000,
                description: 'Возобновление издания журнала "Театр"'
            },
            {
                year: 2002,
                description: 'Премьера трилогии Тома Стоппарда "Берег Утопии", Королевский Национальеый театр, Лондон'
            },
            {
                year: 2002,
                description: 'Премьера трилогии Тома Стоппарда "Берег Утопии", Королевский Национальеый театр, Лондон'
            },
        ]
    },
    {
        startYear: 2006,
        endYear: 2014,
        title: 'Спорт',
        events: [
            {
                year: 2006,
                description: 'Баскетбольный клуб ЦСКА стал победителем национального первенства в России'
            },
            {
                year: 2008,
                description: 'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры'
            },
            {
                year: 2010,
                description: '13-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года'
            },
            {
                year: 2012,
                description: '2 августа - Летние Олимпийские игры'
            },
            {
                year: 2014,
                description: 'XXII зимние Олимпийские игры (Сочи, Россия)'
            },
        ]
    },
    {
        startYear: 2015,
        endYear: 2022,
        title: 'Наука',
        events: [
            {
                year: 2015,
                description: '13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды'
            },
            {
                year: 2016,
                description: 'Телескоп "Хаббл" обнаружил самую удаленную из всех обнаруженных галактик, получившую обозначение GN-z11'
            },
            {
                year: 2017,
                description: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi'
            },
            {
                year: 2018,
                description: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца'
            },
            {
                year: 2019,
                description: 'Google объявил о создании 53-кубитного квантового компьютера'
            },
            {
                year: 2020,
                description: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полета'
            },
        ]
    }
];

export default mockData;